; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-8-3-23)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	driver6 - driver
	driver7 - driver
	driver8 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	package9 - package
	package10 - package
	package11 - package
	package12 - package
	package13 - package
	package14 - package
	package15 - package
	package16 - package
	package17 - package
	package18 - package
	package19 - package
	package20 - package
	package21 - package
	package22 - package
	package23 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	p0-2 - location
	p0-3 - location
	p1-2 - location
	p2-0 - location
	p2-5 - location
	p3-0 - location
	p3-2 - location
	p3-4 - location
	p4-0 - location
	p5-1 - location
	)
	(:init
	(at driver1 s1)
	(at driver2 s0)
	(at driver3 s0)
	(at driver4 s0)
	(at driver5 s4)
	(at driver6 s3)
	(at driver7 s1)
	(at driver8 s2)
	(at truck1 s2)
	(empty truck1)
	(at truck2 s2)
	(empty truck2)
	(at truck3 s1)
	(empty truck3)
	(at package1 s2)
	(at package2 s4)
	(at package3 s3)
	(at package4 s1)
	(at package5 s4)
	(at package6 s2)
	(at package7 s2)
	(at package8 s3)
	(at package9 s2)
	(at package10 s4)
	(at package11 s1)
	(at package12 s0)
	(at package13 s5)
	(at package14 s4)
	(at package15 s1)
	(at package16 s1)
	(at package17 s5)
	(at package18 s2)
	(at package19 s5)
	(at package20 s1)
	(at package21 s3)
	(at package22 s5)
	(at package23 s2)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(path s2 p2-5)
	(path p2-5 s2)
	(path s5 p2-5)
	(path p2-5 s5)
	(path s3 p3-2)
	(path p3-2 s3)
	(path s2 p3-2)
	(path p3-2 s2)
	(path s3 p3-4)
	(path p3-4 s3)
	(path s4 p3-4)
	(path p3-4 s4)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(path s5 p5-1)
	(path p5-1 s5)
	(path s1 p5-1)
	(path p5-1 s1)
	(link s0 s1)
	(link s1 s0)
	(link s0 s2)
	(link s2 s0)
	(link s0 s4)
	(link s4 s0)
	(link s1 s2)
	(link s2 s1)
	(link s1 s5)
	(link s5 s1)
	(link s3 s0)
	(link s0 s3)
	(link s3 s4)
	(link s4 s3)
	(link s3 s5)
	(link s5 s3)
	(link s5 s0)
	(link s0 s5)
	(link s5 s2)
	(link s2 s5)
	(link s5 s4)
	(link s4 s5)
)
	(:goal (and
	(at driver2 s2)
	(at driver3 s0)
	(at driver4 s5)
	(at driver5 s3)
	(at driver6 s3)
	(at truck1 s5)
	(at truck2 s4)
	(at truck3 s5)
	(at package1 s0)
	(at package2 s0)
	(at package3 s0)
	(at package4 s4)
	(at package5 s2)
	(at package6 s4)
	(at package7 s0)
	(at package8 s2)
	(at package9 s4)
	(at package10 s0)
	(at package11 s2)
	(at package12 s0)
	(at package13 s4)
	(at package14 s0)
	(at package15 s5)
	(at package16 s1)
	(at package17 s3)
	(at package19 s4)
	(at package20 s2)
	(at package21 s4)
	(at package22 s4)
	(at package23 s4)
	))


)

; plan
1. (board-truck driver7 s1 truck3)
   deleted: (at driver7 s1) (empty truck3)
   added: (driving driver7 truck3)
   goals met: 4 of 30
2. (drive-truck driver7 s1 s5 truck3)
   deleted: (at truck3 s1)
   added: (at truck3 s5)
   goals met: 5 of 30
3. (board-truck driver8 s2 truck1)
   deleted: (at driver8 s2) (empty truck1)
   added: (driving driver8 truck1)
   goals met: 5 of 30
4. (walk driver2 s0 p0-2)
   deleted: (at driver2 s0)
   added: (at driver2 p0-2)
   goals met: 5 of 30
5. (walk driver2 p0-2 s2)
   deleted: (at driver2 p0-2)
   added: (at driver2 s2)
   goals met: 6 of 30
6. (walk driver4 s0 p0-2)
   deleted: (at driver4 s0)
   added: (at driver4 p0-2)
   goals met: 6 of 30
7. (walk driver4 p0-2 s2)
   deleted: (at driver4 p0-2)
   added: (at driver4 s2)
   goals met: 6 of 30
8. (board-truck driver4 s2 truck2)
   deleted: (at driver4 s2) (empty truck2)
   added: (driving driver4 truck2)
   goals met: 6 of 30
9. (drive-truck driver8 s2 s1 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s1)
   goals met: 6 of 30
10. (walk driver5 s4 p3-4)
   deleted: (at driver5 s4)
   added: (at driver5 p3-4)
   goals met: 6 of 30
11. (walk driver5 p3-4 s3)
   deleted: (at driver5 p3-4)
   added: (at driver5 s3)
   goals met: 7 of 30
12. (load-truck s1 package4 truck1)
   deleted: (at package4 s1)
   added: (in package4 truck1)
   goals met: 7 of 30
13. (load-truck s1 package20 truck1)
   deleted: (at package20 s1)
   added: (in package20 truck1)
   goals met: 7 of 30
14. (load-truck s1 package15 truck1)
   deleted: (at package15 s1)
   added: (in package15 truck1)
   goals met: 7 of 30
15. (drive-truck driver8 s1 s5 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s5)
   goals met: 8 of 30
16. (drive-truck driver7 s5 s3 truck3)
   deleted: (at truck3 s5)
   added: (at truck3 s3)
   goals met: 7 of 30
17. (drive-truck driver7 s3 s4 truck3)
   deleted: (at truck3 s3)
   added: (at truck3 s4)
   goals met: 7 of 30
18. (load-truck s5 package22 truck1)
   deleted: (at package22 s5)
   added: (in package22 truck1)
   goals met: 7 of 30
19. (load-truck s5 package19 truck1)
   deleted: (at package19 s5)
   added: (in package19 truck1)
   goals met: 7 of 30
20. (load-truck s5 package17 truck1)
   deleted: (at package17 s5)
   added: (in package17 truck1)
   goals met: 7 of 30
21. (unload-truck s5 package15 truck1)
   deleted: (in package15 truck1)
   added: (at package15 s5)
   goals met: 8 of 30
22. (drive-truck driver8 s5 s3 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s3)
   goals met: 7 of 30
23. (load-truck s3 package8 truck1)
   deleted: (at package8 s3)
   added: (in package8 truck1)
   goals met: 7 of 30
24. (drive-truck driver8 s3 s5 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s5)
   goals met: 8 of 30
25. (load-truck s5 package13 truck1)
   deleted: (at package13 s5)
   added: (in package13 truck1)
   goals met: 8 of 30
26. (drive-truck driver8 s5 s4 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s4)
   goals met: 7 of 30
27. (drive-truck driver7 s4 s5 truck3)
   deleted: (at truck3 s4)
   added: (at truck3 s5)
   goals met: 8 of 30
28. (load-truck s4 package5 truck1)
   deleted: (at package5 s4)
   added: (in package5 truck1)
   goals met: 8 of 30
29. (unload-truck s4 package4 truck1)
   deleted: (in package4 truck1)
   added: (at package4 s4)
   goals met: 9 of 30
30. (unload-truck s4 package22 truck1)
   deleted: (in package22 truck1)
   added: (at package22 s4)
   goals met: 10 of 30
31. (load-truck s4 package2 truck1)
   deleted: (at package2 s4)
   added: (in package2 truck1)
   goals met: 10 of 30
32. (unload-truck s4 package19 truck1)
   deleted: (in package19 truck1)
   added: (at package19 s4)
   goals met: 11 of 30
33. (drive-truck driver8 s4 s0 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s0)
   goals met: 11 of 30
34. (unload-truck s0 package2 truck1)
   deleted: (in package2 truck1)
   added: (at package2 s0)
   goals met: 12 of 30
35. (drive-truck driver8 s0 s2 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   goals met: 12 of 30
36. (drive-truck driver7 s5 s3 truck3)
   deleted: (at truck3 s5)
   added: (at truck3 s3)
   goals met: 11 of 30
37. (drive-truck driver4 s2 s5 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s5)
   goals met: 11 of 30
38. (drive-truck driver4 s5 s4 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s4)
   goals met: 12 of 30
39. (load-truck s2 package9 truck1)
   deleted: (at package9 s2)
   added: (in package9 truck1)
   goals met: 12 of 30
40. (unload-truck s2 package8 truck1)
   deleted: (in package8 truck1)
   added: (at package8 s2)
   goals met: 13 of 30
41. (load-truck s2 package7 truck1)
   deleted: (at package7 s2)
   added: (in package7 truck1)
   goals met: 13 of 30
42. (load-truck s2 package6 truck1)
   deleted: (at package6 s2)
   added: (in package6 truck1)
   goals met: 13 of 30
43. (drive-truck driver8 s2 s0 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   goals met: 13 of 30
44. (unload-truck s0 package7 truck1)
   deleted: (in package7 truck1)
   added: (at package7 s0)
   goals met: 14 of 30
45. (drive-truck driver8 s0 s5 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s5)
   goals met: 15 of 30
46. (load-truck s4 package14 truck2)
   deleted: (at package14 s4)
   added: (in package14 truck2)
   goals met: 15 of 30
47. (load-truck s4 package10 truck2)
   deleted: (at package10 s4)
   added: (in package10 truck2)
   goals met: 15 of 30
48. (drive-truck driver4 s4 s0 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s0)
   goals met: 14 of 30
49. (unload-truck s0 package14 truck2)
   deleted: (in package14 truck2)
   added: (at package14 s0)
   goals met: 15 of 30
50. (unload-truck s0 package10 truck2)
   deleted: (in package10 truck2)
   added: (at package10 s0)
   goals met: 16 of 30
51. (drive-truck driver4 s0 s2 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s2)
   goals met: 16 of 30
52. (load-truck s2 package23 truck2)
   deleted: (at package23 s2)
   added: (in package23 truck2)
   goals met: 16 of 30
53. (drive-truck driver4 s2 s5 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s5)
   goals met: 16 of 30
54. (drive-truck driver4 s5 s4 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s4)
   goals met: 17 of 30
55. (unload-truck s4 package23 truck2)
   deleted: (in package23 truck2)
   added: (at package23 s4)
   goals met: 18 of 30
56. (load-truck s3 package3 truck3)
   deleted: (at package3 s3)
   added: (in package3 truck3)
   goals met: 18 of 30
57. (load-truck s3 package21 truck3)
   deleted: (at package21 s3)
   added: (in package21 truck3)
   goals met: 18 of 30
58. (drive-truck driver7 s3 s0 truck3)
   deleted: (at truck3 s3)
   added: (at truck3 s0)
   goals met: 18 of 30
59. (unload-truck s0 package3 truck3)
   deleted: (in package3 truck3)
   added: (at package3 s0)
   goals met: 19 of 30
60. (drive-truck driver7 s0 s4 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s4)
   goals met: 19 of 30
61. (unload-truck s4 package21 truck3)
   deleted: (in package21 truck3)
   added: (at package21 s4)
   goals met: 20 of 30
62. (drive-truck driver7 s4 s5 truck3)
   deleted: (at truck3 s4)
   added: (at truck3 s5)
   goals met: 21 of 30
63. (drive-truck driver8 s5 s4 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s4)
   goals met: 20 of 30
64. (unload-truck s4 package9 truck1)
   deleted: (in package9 truck1)
   added: (at package9 s4)
   goals met: 21 of 30
65. (unload-truck s4 package6 truck1)
   deleted: (in package6 truck1)
   added: (at package6 s4)
   goals met: 22 of 30
66. (drive-truck driver8 s4 s5 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s5)
   goals met: 23 of 30
67. (drive-truck driver8 s5 s2 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s2)
   goals met: 22 of 30
68. (unload-truck s2 package5 truck1)
   deleted: (in package5 truck1)
   added: (at package5 s2)
   goals met: 23 of 30
69. (unload-truck s2 package20 truck1)
   deleted: (in package20 truck1)
   added: (at package20 s2)
   goals met: 24 of 30
70. (drive-truck driver8 s2 s5 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s5)
   goals met: 25 of 30
71. (drive-truck driver8 s5 s3 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s3)
   goals met: 24 of 30
72. (unload-truck s3 package17 truck1)
   deleted: (in package17 truck1)
   added: (at package17 s3)
   goals met: 25 of 30
73. (drive-truck driver8 s3 s4 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s4)
   goals met: 25 of 30
74. (unload-truck s4 package13 truck1)
   deleted: (in package13 truck1)
   added: (at package13 s4)
   goals met: 26 of 30
75. (drive-truck driver8 s4 s5 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s5)
   goals met: 27 of 30
76. (drive-truck driver8 s5 s1 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s1)
   goals met: 26 of 30
77. (load-truck s1 package11 truck1)
   deleted: (at package11 s1)
   added: (in package11 truck1)
   goals met: 26 of 30
78. (drive-truck driver8 s1 s2 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   goals met: 26 of 30
79. (unload-truck s2 package11 truck1)
   deleted: (in package11 truck1)
   added: (at package11 s2)
   goals met: 27 of 30
80. (load-truck s2 package1 truck1)
   deleted: (at package1 s2)
   added: (in package1 truck1)
   goals met: 27 of 30
81. (drive-truck driver8 s2 s0 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   goals met: 27 of 30
82. (unload-truck s0 package1 truck1)
   deleted: (in package1 truck1)
   added: (at package1 s0)
   goals met: 28 of 30
83. (drive-truck driver8 s0 s5 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s5)
   goals met: 29 of 30
84. (disembark-truck driver7 s5 truck3)
   deleted: (driving driver7 truck3)
   added: (at driver7 s5) (empty truck3)
   goals met: 29 of 30
85. (drive-truck driver4 s4 s5 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s5)
   goals met: 28 of 30
86. (disembark-truck driver4 s5 truck2)
   deleted: (driving driver4 truck2)
   added: (at driver4 s5) (empty truck2)
   goals met: 29 of 30
87. (board-truck driver7 s5 truck2)
   deleted: (at driver7 s5) (empty truck2)
   added: (driving driver7 truck2)
   goals met: 29 of 30
88. (drive-truck driver7 s5 s4 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s4)
   goals met: 30 of 30
